In [4]:
from env import get_db_url 
import pandas as pd
import numpy as np

In [14]:
employees_url = get_db_url("employees")

In [15]:
employees = pd.read_sql('select * from employees limit 5', employees_url)
df

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [7]:
url = get_db_url('employes')

In [12]:
df = pd.read_sql('select * from employees', url)

In [36]:
titles = pd.read_sql('select * from titles', employees_url)
titles

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [29]:
employees.mode()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02    Bezalel   Bamford      M  1985-11-21
1   10002  1954-05-01  Chirstian   Facello    NaN  1986-06-26
2   10003  1955-01-21     Georgi   Koblick    NaN  1986-08-28
3   10004  1959-12-03    Kyoichi  Maliniak    NaN  1986-12-01
4   10005  1964-06-02      Parto    Simmel    NaN  1989-09-12

In [31]:
titles.mode()

    emp_no            title   from_date     to_date
0  10004.0  Senior Engineer  1986-06-26  9999-01-01
1  10005.0              NaN  1986-12-01         NaN
2  10007.0              NaN  1989-02-10         NaN
3      NaN              NaN  1989-09-12         NaN
4      NaN              NaN  1990-08-05         NaN
5      NaN              NaN  1995-12-01         NaN
6      NaN              NaN  1995-12-03         NaN
7      NaN              NaN  1996-02-11         NaN
8      NaN              NaN  1996-08-03         NaN
9      NaN              NaN  1996-09-12         NaN

In [34]:
pd.unique(titles.title)

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff'],
      dtype=object)

In [41]:
titles.sort_values("to_date").head(1)

       emp_no     title   from_date     to_date
16064   20869  Engineer  1985-02-17  1985-03-01

In [42]:
titles.sort_values("to_date").tail(1)

        emp_no     title   from_date     to_date
443307  499999  Engineer  1997-11-30  9999-01-01